---
type: RebarBendingDetail
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 8
tags: [revit-api, class]
---

# RebarBendingDetail

`Autodesk.Revit.DB.Structure.RebarBendingDetail` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2024 | `public static Element Create ( Document document , ElementId viewId , ElementId reinforcementElementId , int reinforcementElementSubelementKey , RebarBendingDetailType bendingDetailType , XYZ position , double rotation )` |
| Method | GetHost | 2024 | `public static Reference GetHost ( Element bendingDetail )` |
| Method | GetPosition | 2024 | `public static XYZ GetPosition ( Element bendingDetail )` |
| Method | GetRotation | 2024 | `public static double GetRotation ( Element bendingDetail )` |
| Method | IsBendingDetail | 2024 | `public static bool IsBendingDetail ( Element bendingDetail )` |
| Method | SetHost | 2024 | `public static void SetHost ( Element bendingDetail , Reference reference )` |
| Method | SetPosition | 2024 | `public static void SetPosition ( Element bendingDetail , XYZ position )` |
| Method | SetRotation | 2024 | `public static void SetRotation ( Element bendingDetail , double rotation )` |